app/controllers/api/v1/games_controller.rb

  def create
    @game = Game.create(game_params)
---
INSERT INTO "games" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2019-01-02 14:25:48.788918"], ["updated_at", "2019-01-02 14:25:48.788918"]]

  def find_game
    @game = Game.find(params[:id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]