app/controllers/api/v1/rounds_controller.rb

SELECT "rounds".* FROM "rounds"
---
  def index
    @rounds = Round.all

INSERT INTO "rounds" ("game_id", "category", "difficulty", "question", "correct_answer", "incorrect_answer_1", "incorrect_answer_2", "incorrect_answer_3", "correct", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @round = Round.create(round_params)
    @round.save

UPDATE "rounds" SET "answer" = $1, "correct" = $2, "updated_at" = $3 WHERE "rounds"."id" = $4  [["answer", "Atlanta"], ["correct", true], ["updated_at", "2019-01-02 17:15:55.929957"], ["id", 289]]
---
  def update
    @round.update(round_params)

SELECT  "rounds".* FROM "rounds" WHERE "rounds"."id" = $1 LIMIT $2  [["id", 251], ["LIMIT", 1]]
---
  def find_round
    @round = Round.find(params[:id])