app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "test"], ["created_at", "2018-12-31 15:18:38.745845"], ["updated_at", "2018-12-31 15:18:38.745845"]]
---
  def create
    @user = User.create(user_params)