app/models/user.rb

  def allRounds
    roundsArray = []
    self.games.each {|game| roundsArray.concat(game.rounds) }
---
SELECT "games".* FROM "games" WHERE "games"."user_id" = $1  [["user_id", 1]]
SELECT "rounds".* FROM "rounds" WHERE "rounds"."game_id" = $1  [["game_id", 1]]